tap "homebrew/bundle"
brew "boost"
brew "brew-cask-completion"
brew "cmake"
brew "curl"
brew "dash-shell"
brew "dos2unix"
brew "doxygen"
brew "gcc"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "graphviz"
brew "icu4c@76"
brew "jsoncpp"
brew "make"
brew "mas"
brew "mysql"
brew "pandoc"
brew "pandoc-crossref"
brew "pandoc-include-code"
brew "pandoc-plot"
brew "pkgconf"
brew "sqlite"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.13"
brew "ruff"
brew "uv"
brew "vim"
brew "wget"
brew "zsh-completions"
cask "adobe-creative-cloud"
cask "android-file-transfer"
cask "android-ndk"
cask "android-sdk"
cask "android-studio"
cask "appcleaner"
cask "archiver-app"
cask "balenaetcher"
cask "beyond-compare"
cask "brackets"
cask "clion"
cask "copilot-for-xcode"
cask "dash"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "lastpass"
cask "logitech-options"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "oracle-jdk"
cask "postman"
cask "raspberry-pi-imager"
cask "rectangle"
cask "slack"
cask "sublime-text"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "vnc-viewer"
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "iStatistica Pro", id: 1447778660
mas "Keynote", id: 409183694
mas "LastPass for Safari", id: 6504626762
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Messenger", id: 1480068668
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
