tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
brew "boost"
brew "brew-cask-completion"
brew "sqlite"
brew "python@3.11"
brew "cmake"
brew "curl"
brew "dash", link: false
brew "dos2unix"
brew "doxygen"
brew "gcc"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "jsoncpp"
brew "make"
brew "mas"
brew "mysql"
brew "pandoc"
brew "pandoc-crossref"
brew "pandoc-include-code"
brew "pandoc-plot"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "vim"
brew "wget"
brew "zsh-completions"
cask "adobe-creative-cloud"
cask "airdroid"
cask "android-file-transfer"
cask "android-ndk"
cask "android-sdk"
cask "android-studio"
cask "appcleaner"
cask "archiver"
cask "beyond-compare"
cask "brackets"
cask "clion"
cask "copilot-for-xcode"
cask "dash"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "lastpass"
cask "logitech-options"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "raspberry-pi-imager"
cask "rectangle"
cask "slack"
cask "sublime-text"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "vnc-viewer"
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "iStatistica Pro", id: 1447778660
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Messenger", id: 1480068668
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
vscode "bungcip.better-toml"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-nightly"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "twxs.cmake"
vscode "vscodevim.vim"
