cschlosser.doxdocgen
eamodio.gitlens
esbenp.prettier-vscode
GitHub.copilot
jeff-hykin.better-cpp-syntax
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
njpwerner.autodocstring
twxs.cmake
vscodevim.vim
